Tekla Open API Reference for Tekla Structures 2025
Units Enumeration
 The available unit types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum Units
Public Enumeration Units
Members
Member name | Value | Description
Automatic | 0 | Automatic, chooses the most appropriate unit for the current environment.
Millimeters | 1 | Show the value in millimeters.
Centimeters | 2 | Show the value in centimeters.
Meters | 3 | Show the value in meters.
FeetAndInches | 4 | Show the value in feet and inches.
CentimetersOrMeters | 5 | Show the value in centimeters or meters whichever is more appropriate.
Inches | 6 | Show the value in inches.
Feet | 7 | Show the value in feet.
See Also
Reference
Tekla.Structures.Drawing Namespace